Revit 2024 API
TopographyEditScope Constructor
 Instantiates a TopographyEditScope object.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public TopographyEditScope(
	Document document,
	string transactionName
)
Visual Basic
Public Sub New ( _
	document As Document, _
	transactionName As String _
)
Visual C++
public:
TopographyEditScope(
	Document^ document,
	String^ transactionName
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document for which this TopographyEditScope is going to be used.
transactionName
Type: System.String
 The name that will appear in the Undo menu in Revit after the TopographyEditScope is successfully committed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a primary document, it is a linked document. -or- document is not a project document. -or- transactionName is an empty string.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace